; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=380, out_folder=./training, instance_id=26, seed=2050, goal_proportion=0.03

(define (problem blocksworld-26)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 b301 b302 b303 b304 b305 b306 b307 b308 b309 b310 b311 b312 b313 b314 b315 b316 b317 b318 b319 b320 b321 b322 b323 b324 b325 b326 b327 b328 b329 b330 b331 b332 b333 b334 b335 b336 b337 b338 b339 b340 b341 b342 b343 b344 b345 b346 b347 b348 b349 b350 b351 b352 b353 b354 b355 b356 b357 b358 b359 b360 b361 b362 b363 b364 b365 b366 b367 b368 b369 b370 b371 b372 b373 b374 b375 b376 b377 b378 b379 b380 - object)
 (:init 
    (arm-empty)
    (clear b96)
    (on-table b96)
    (clear b98)
    (on b98 b66)
    (on b66 b2)
    (on b2 b16)
    (on-table b16)
    (clear b138)
    (on b138 b120)
    (on b120 b104)
    (on-table b104)
    (clear b183)
    (on-table b183)
    (clear b119)
    (on b119 b232)
    (on b232 b126)
    (on-table b126)
    (clear b265)
    (on b265 b326)
    (on b326 b89)
    (on-table b89)
    (clear b360)
    (on b360 b344)
    (on-table b344)
    (clear b227)
    (on-table b227)
    (clear b93)
    (on b93 b331)
    (on b331 b103)
    (on b103 b286)
    (on b286 b239)
    (on b239 b195)
    (on b195 b10)
    (on-table b10)
    (clear b305)
    (on b305 b6)
    (on b6 b206)
    (on b206 b303)
    (on b303 b219)
    (on-table b219)
    (clear b323)
    (on b323 b374)
    (on b374 b292)
    (on b292 b99)
    (on b99 b224)
    (on b224 b345)
    (on b345 b271)
    (on b271 b72)
    (on b72 b208)
    (on-table b208)
    (clear b362)
    (on-table b362)
    (clear b125)
    (on b125 b64)
    (on-table b64)
    (clear b253)
    (on b253 b141)
    (on-table b141)
    (clear b369)
    (on b369 b68)
    (on b68 b118)
    (on b118 b296)
    (on b296 b109)
    (on b109 b301)
    (on b301 b107)
    (on-table b107)
    (clear b214)
    (on b214 b75)
    (on b75 b50)
    (on b50 b358)
    (on b358 b283)
    (on-table b283)
    (clear b87)
    (on b87 b379)
    (on-table b379)
    (clear b300)
    (on b300 b240)
    (on-table b240)
    (clear b77)
    (on-table b77)
    (clear b348)
    (on b348 b92)
    (on-table b92)
    (clear b346)
    (on b346 b350)
    (on b350 b152)
    (on b152 b65)
    (on b65 b207)
    (on b207 b231)
    (on b231 b188)
    (on-table b188)
    (clear b122)
    (on b122 b312)
    (on b312 b257)
    (on b257 b186)
    (on b186 b255)
    (on b255 b325)
    (on b325 b133)
    (on b133 b17)
    (on b17 b88)
    (on-table b88)
    (clear b62)
    (on b62 b25)
    (on b25 b95)
    (on b95 b339)
    (on b339 b293)
    (on-table b293)
    (clear b279)
    (on-table b279)
    (clear b244)
    (on-table b244)
    (clear b38)
    (on b38 b115)
    (on b115 b242)
    (on b242 b112)
    (on b112 b190)
    (on b190 b230)
    (on b230 b158)
    (on b158 b347)
    (on b347 b354)
    (on b354 b173)
    (on b173 b67)
    (on b67 b22)
    (on b22 b198)
    (on b198 b335)
    (on-table b335)
    (clear b261)
    (on b261 b70)
    (on-table b70)
    (clear b163)
    (on b163 b101)
    (on-table b101)
    (clear b52)
    (on b52 b229)
    (on b229 b343)
    (on b343 b26)
    (on b26 b264)
    (on-table b264)
    (clear b83)
    (on-table b83)
    (clear b291)
    (on b291 b86)
    (on b86 b251)
    (on b251 b80)
    (on-table b80)
    (clear b276)
    (on-table b276)
    (clear b295)
    (on-table b295)
    (clear b1)
    (on b1 b54)
    (on-table b54)
    (clear b197)
    (on b197 b319)
    (on-table b319)
    (clear b371)
    (on b371 b175)
    (on b175 b44)
    (on-table b44)
    (clear b114)
    (on b114 b85)
    (on-table b85)
    (clear b181)
    (on b181 b30)
    (on b30 b90)
    (on-table b90)
    (clear b309)
    (on-table b309)
    (clear b51)
    (on b51 b338)
    (on-table b338)
    (clear b365)
    (on b365 b149)
    (on b149 b27)
    (on b27 b84)
    (on-table b84)
    (clear b69)
    (on-table b69)
    (clear b167)
    (on-table b167)
    (clear b378)
    (on b378 b262)
    (on-table b262)
    (clear b61)
    (on b61 b364)
    (on-table b364)
    (clear b336)
    (on-table b336)
    (clear b267)
    (on-table b267)
    (clear b32)
    (on b32 b258)
    (on-table b258)
    (clear b71)
    (on-table b71)
    (clear b174)
    (on b174 b376)
    (on b376 b160)
    (on-table b160)
    (clear b285)
    (on-table b285)
    (clear b136)
    (on-table b136)
    (clear b375)
    (on b375 b43)
    (on b43 b178)
    (on b178 b55)
    (on-table b55)
    (clear b313)
    (on-table b313)
    (clear b368)
    (on b368 b146)
    (on b146 b12)
    (on b12 b63)
    (on b63 b166)
    (on b166 b328)
    (on b328 b168)
    (on-table b168)
    (clear b154)
    (on b154 b238)
    (on-table b238)
    (clear b60)
    (on b60 b241)
    (on b241 b256)
    (on b256 b282)
    (on b282 b280)
    (on-table b280)
    (clear b41)
    (on-table b41)
    (clear b302)
    (on b302 b47)
    (on b47 b9)
    (on b9 b91)
    (on b91 b373)
    (on-table b373)
    (clear b39)
    (on-table b39)
    (clear b20)
    (on b20 b33)
    (on b33 b35)
    (on-table b35)
    (clear b139)
    (on b139 b213)
    (on b213 b201)
    (on b201 b117)
    (on b117 b269)
    (on b269 b337)
    (on b337 b202)
    (on b202 b48)
    (on b48 b176)
    (on b176 b23)
    (on-table b23)
    (clear b134)
    (on b134 b148)
    (on b148 b260)
    (on b260 b159)
    (on b159 b273)
    (on b273 b250)
    (on b250 b57)
    (on b57 b105)
    (on b105 b243)
    (on b243 b233)
    (on-table b233)
    (clear b318)
    (on b318 b15)
    (on-table b15)
    (clear b199)
    (on-table b199)
    (clear b290)
    (on b290 b108)
    (on b108 b320)
    (on-table b320)
    (clear b171)
    (on b171 b200)
    (on b200 b236)
    (on b236 b78)
    (on b78 b272)
    (on b272 b21)
    (on b21 b13)
    (on b13 b203)
    (on b203 b123)
    (on b123 b147)
    (on-table b147)
    (clear b116)
    (on b116 b297)
    (on b297 b124)
    (on b124 b218)
    (on b218 b246)
    (on b246 b352)
    (on b352 b58)
    (on b58 b349)
    (on b349 b177)
    (on b177 b8)
    (on-table b8)
    (clear b131)
    (on b131 b73)
    (on-table b73)
    (clear b49)
    (on-table b49)
    (clear b277)
    (on b277 b314)
    (on b314 b288)
    (on b288 b130)
    (on-table b130)
    (clear b29)
    (on b29 b294)
    (on b294 b143)
    (on-table b143)
    (clear b3)
    (on b3 b180)
    (on-table b180)
    (clear b340)
    (on b340 b321)
    (on b321 b169)
    (on b169 b45)
    (on b45 b220)
    (on b220 b106)
    (on-table b106)
    (clear b156)
    (on b156 b170)
    (on b170 b270)
    (on b270 b275)
    (on-table b275)
    (clear b36)
    (on b36 b311)
    (on b311 b42)
    (on b42 b299)
    (on b299 b193)
    (on-table b193)
    (clear b140)
    (on b140 b298)
    (on b298 b82)
    (on b82 b161)
    (on b161 b234)
    (on b234 b97)
    (on-table b97)
    (clear b237)
    (on b237 b329)
    (on b329 b322)
    (on b322 b367)
    (on b367 b155)
    (on b155 b4)
    (on b4 b332)
    (on b332 b53)
    (on b53 b355)
    (on-table b355)
    (clear b228)
    (on b228 b74)
    (on-table b74)
    (clear b196)
    (on b196 b153)
    (on-table b153)
    (clear b289)
    (on b289 b357)
    (on b357 b327)
    (on-table b327)
    (clear b204)
    (on b204 b254)
    (on b254 b132)
    (on b132 b235)
    (on b235 b157)
    (on b157 b205)
    (on b205 b226)
    (on b226 b151)
    (on-table b151)
    (clear b5)
    (on b5 b11)
    (on b11 b324)
    (on b324 b79)
    (on b79 b215)
    (on b215 b102)
    (on-table b102)
    (clear b281)
    (on b281 b316)
    (on b316 b150)
    (on b150 b351)
    (on b351 b284)
    (on-table b284)
    (clear b278)
    (on b278 b18)
    (on b18 b46)
    (on b46 b308)
    (on-table b308)
    (clear b222)
    (on b222 b341)
    (on b341 b145)
    (on b145 b356)
    (on-table b356)
    (clear b165)
    (on-table b165)
    (clear b28)
    (on b28 b14)
    (on b14 b56)
    (on b56 b76)
    (on b76 b94)
    (on b94 b266)
    (on b266 b217)
    (on-table b217)
    (clear b252)
    (on b252 b19)
    (on b19 b113)
    (on b113 b31)
    (on b31 b81)
    (on b81 b7)
    (on b7 b100)
    (on-table b100)
    (clear b59)
    (on b59 b353)
    (on b353 b274)
    (on b274 b306)
    (on-table b306)
    (clear b187)
    (on-table b187)
    (clear b361)
    (on-table b361)
    (clear b164)
    (on b164 b110)
    (on b110 b287)
    (on b287 b189)
    (on-table b189)
    (clear b315)
    (on b315 b263)
    (on b263 b333)
    (on b333 b127)
    (on b127 b247)
    (on b247 b225)
    (on b225 b259)
    (on b259 b211)
    (on-table b211)
    (clear b363)
    (on b363 b212)
    (on b212 b216)
    (on b216 b310)
    (on-table b310)
    (clear b40)
    (on b40 b366)
    (on-table b366)
    (clear b359)
    (on b359 b248)
    (on b248 b245)
    (on-table b245)
    (clear b162)
    (on b162 b121)
    (on b121 b135)
    (on b135 b209)
    (on b209 b221)
    (on b221 b191)
    (on b191 b268)
    (on-table b268)
    (clear b144)
    (on b144 b142)
    (on b142 b24)
    (on b24 b185)
    (on b185 b223)
    (on b223 b249)
    (on b249 b34)
    (on-table b34)
    (clear b129)
    (on b129 b128)
    (on b128 b380)
    (on b380 b37)
    (on b37 b377)
    (on b377 b179)
    (on b179 b192)
    (on b192 b317)
    (on b317 b370)
    (on b370 b307)
    (on b307 b334)
    (on b334 b330)
    (on-table b330)
    (clear b342)
    (on b342 b184)
    (on b184 b210)
    (on-table b210)
    (clear b182)
    (on-table b182)
    (clear b372)
    (on-table b372)
    (clear b137)
    (on b137 b194)
    (on-table b194)
    (clear b111)
    (on b111 b172)
    (on b172 b304)
    (on-table b304))
 (:goal  (and 
    (clear b6)
    (on b6 b11)
    (on b11 b7)
    (on b7 b2)
    (on-table b2)
    (clear b10)
    (on b10 b5)
    (on b5 b9)
    (on b9 b3)
    (on b3 b8)
    (on b8 b4)
    (on-table b4)
    (clear b1)
    (on-table b1))))

; plan
1. (unstack b1 b54)
   deleted: (on b1 b54) (clear b1) (arm-empty)
   added: (holding b1) (clear b54)
   goals met: 0 of 14
2. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 2 of 14
3. (unstack b116 b297)
   deleted: (on b116 b297) (clear b116) (arm-empty)
   added: (holding b116) (clear b297)
   goals met: 2 of 14
4. (putdown b116)
   deleted: (holding b116)
   added: (clear b116) (arm-empty) (on-table b116)
   goals met: 2 of 14
5. (unstack b237 b329)
   deleted: (on b237 b329) (clear b237) (arm-empty)
   added: (holding b237) (clear b329)
   goals met: 2 of 14
6. (putdown b237)
   deleted: (holding b237)
   added: (clear b237) (arm-empty) (on-table b237)
   goals met: 2 of 14
7. (unstack b252 b19)
   deleted: (on b252 b19) (clear b252) (arm-empty)
   added: (holding b252) (clear b19)
   goals met: 2 of 14
8. (putdown b252)
   deleted: (holding b252)
   added: (clear b252) (arm-empty) (on-table b252)
   goals met: 2 of 14
9. (unstack b19 b113)
   deleted: (on b19 b113) (clear b19) (arm-empty)
   added: (holding b19) (clear b113)
   goals met: 2 of 14
10. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 2 of 14
11. (unstack b113 b31)
   deleted: (on b113 b31) (clear b113) (arm-empty)
   added: (holding b113) (clear b31)
   goals met: 2 of 14
12. (putdown b113)
   deleted: (holding b113)
   added: (clear b113) (arm-empty) (on-table b113)
   goals met: 2 of 14
13. (unstack b297 b124)
   deleted: (on b297 b124) (clear b297) (arm-empty)
   added: (holding b297) (clear b124)
   goals met: 2 of 14
14. (putdown b297)
   deleted: (holding b297)
   added: (clear b297) (arm-empty) (on-table b297)
   goals met: 2 of 14
15. (unstack b124 b218)
   deleted: (on b124 b218) (clear b124) (arm-empty)
   added: (holding b124) (clear b218)
   goals met: 2 of 14
16. (putdown b124)
   deleted: (holding b124)
   added: (clear b124) (arm-empty) (on-table b124)
   goals met: 2 of 14
17. (unstack b218 b246)
   deleted: (on b218 b246) (clear b218) (arm-empty)
   added: (holding b218) (clear b246)
   goals met: 2 of 14
18. (putdown b218)
   deleted: (holding b218)
   added: (clear b218) (arm-empty) (on-table b218)
   goals met: 2 of 14
19. (unstack b246 b352)
   deleted: (on b246 b352) (clear b246) (arm-empty)
   added: (holding b246) (clear b352)
   goals met: 2 of 14
20. (putdown b246)
   deleted: (holding b246)
   added: (clear b246) (arm-empty) (on-table b246)
   goals met: 2 of 14
21. (unstack b302 b47)
   deleted: (on b302 b47) (clear b302) (arm-empty)
   added: (holding b302) (clear b47)
   goals met: 2 of 14
22. (putdown b302)
   deleted: (holding b302)
   added: (clear b302) (arm-empty) (on-table b302)
   goals met: 2 of 14
23. (unstack b305 b6)
   deleted: (on b305 b6) (clear b305) (arm-empty)
   added: (holding b305) (clear b6)
   goals met: 3 of 14
24. (putdown b305)
   deleted: (holding b305)
   added: (clear b305) (arm-empty) (on-table b305)
   goals met: 3 of 14
25. (unstack b31 b81)
   deleted: (on b31 b81) (clear b31) (arm-empty)
   added: (holding b31) (clear b81)
   goals met: 3 of 14
26. (putdown b31)
   deleted: (holding b31)
   added: (clear b31) (arm-empty) (on-table b31)
   goals met: 3 of 14
27. (unstack b329 b322)
   deleted: (on b329 b322) (clear b329) (arm-empty)
   added: (holding b329) (clear b322)
   goals met: 3 of 14
28. (putdown b329)
   deleted: (holding b329)
   added: (clear b329) (arm-empty) (on-table b329)
   goals met: 3 of 14
29. (unstack b322 b367)
   deleted: (on b322 b367) (clear b322) (arm-empty)
   added: (holding b322) (clear b367)
   goals met: 3 of 14
30. (putdown b322)
   deleted: (holding b322)
   added: (clear b322) (arm-empty) (on-table b322)
   goals met: 3 of 14
31. (unstack b352 b58)
   deleted: (on b352 b58) (clear b352) (arm-empty)
   added: (holding b352) (clear b58)
   goals met: 3 of 14
32. (putdown b352)
   deleted: (holding b352)
   added: (clear b352) (arm-empty) (on-table b352)
   goals met: 3 of 14
33. (unstack b367 b155)
   deleted: (on b367 b155) (clear b367) (arm-empty)
   added: (holding b367) (clear b155)
   goals met: 3 of 14
34. (putdown b367)
   deleted: (holding b367)
   added: (clear b367) (arm-empty) (on-table b367)
   goals met: 3 of 14
35. (unstack b155 b4)
   deleted: (on b155 b4) (clear b155) (arm-empty)
   added: (holding b155) (clear b4)
   goals met: 3 of 14
36. (putdown b155)
   deleted: (holding b155)
   added: (clear b155) (arm-empty) (on-table b155)
   goals met: 3 of 14
37. (unstack b4 b332)
   deleted: (on b4 b332) (clear b4) (arm-empty)
   added: (holding b4) (clear b332)
   goals met: 3 of 14
38. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 4 of 14
39. (unstack b47 b9)
   deleted: (on b47 b9) (clear b47) (arm-empty)
   added: (holding b47) (clear b9)
   goals met: 4 of 14
40. (putdown b47)
   deleted: (holding b47)
   added: (clear b47) (arm-empty) (on-table b47)
   goals met: 4 of 14
41. (unstack b58 b349)
   deleted: (on b58 b349) (clear b58) (arm-empty)
   added: (holding b58) (clear b349)
   goals met: 4 of 14
42. (putdown b58)
   deleted: (holding b58)
   added: (clear b58) (arm-empty) (on-table b58)
   goals met: 4 of 14
43. (unstack b349 b177)
   deleted: (on b349 b177) (clear b349) (arm-empty)
   added: (holding b349) (clear b177)
   goals met: 4 of 14
44. (putdown b349)
   deleted: (holding b349)
   added: (clear b349) (arm-empty) (on-table b349)
   goals met: 4 of 14
45. (unstack b177 b8)
   deleted: (on b177 b8) (clear b177) (arm-empty)
   added: (holding b177) (clear b8)
   goals met: 4 of 14
46. (putdown b177)
   deleted: (holding b177)
   added: (clear b177) (arm-empty) (on-table b177)
   goals met: 4 of 14
47. (unstack b81 b7)
   deleted: (on b81 b7) (clear b81) (arm-empty)
   added: (holding b81) (clear b7)
   goals met: 4 of 14
48. (putdown b81)
   deleted: (holding b81)
   added: (clear b81) (arm-empty) (on-table b81)
   goals met: 4 of 14
49. (unstack b93 b331)
   deleted: (on b93 b331) (clear b93) (arm-empty)
   added: (holding b93) (clear b331)
   goals met: 4 of 14
50. (putdown b93)
   deleted: (holding b93)
   added: (clear b93) (arm-empty) (on-table b93)
   goals met: 4 of 14
51. (unstack b331 b103)
   deleted: (on b331 b103) (clear b331) (arm-empty)
   added: (holding b331) (clear b103)
   goals met: 4 of 14
52. (putdown b331)
   deleted: (holding b331)
   added: (clear b331) (arm-empty) (on-table b331)
   goals met: 4 of 14
53. (unstack b103 b286)
   deleted: (on b103 b286) (clear b103) (arm-empty)
   added: (holding b103) (clear b286)
   goals met: 4 of 14
54. (putdown b103)
   deleted: (holding b103)
   added: (clear b103) (arm-empty) (on-table b103)
   goals met: 4 of 14
55. (unstack b286 b239)
   deleted: (on b286 b239) (clear b286) (arm-empty)
   added: (holding b286) (clear b239)
   goals met: 4 of 14
56. (putdown b286)
   deleted: (holding b286)
   added: (clear b286) (arm-empty) (on-table b286)
   goals met: 4 of 14
57. (unstack b239 b195)
   deleted: (on b239 b195) (clear b239) (arm-empty)
   added: (holding b239) (clear b195)
   goals met: 4 of 14
58. (putdown b239)
   deleted: (holding b239)
   added: (clear b239) (arm-empty) (on-table b239)
   goals met: 4 of 14
59. (unstack b195 b10)
   deleted: (on b195 b10) (clear b195) (arm-empty)
   added: (holding b195) (clear b10)
   goals met: 5 of 14
60. (putdown b195)
   deleted: (holding b195)
   added: (clear b195) (arm-empty) (on-table b195)
   goals met: 5 of 14
61. (unstack b98 b66)
   deleted: (on b98 b66) (clear b98) (arm-empty)
   added: (holding b98) (clear b66)
   goals met: 5 of 14
62. (putdown b98)
   deleted: (holding b98)
   added: (clear b98) (arm-empty) (on-table b98)
   goals met: 5 of 14
63. (unstack b66 b2)
   deleted: (on b66 b2) (clear b66) (arm-empty)
   added: (holding b66) (clear b2)
   goals met: 5 of 14
64. (putdown b66)
   deleted: (holding b66)
   added: (clear b66) (arm-empty) (on-table b66)
   goals met: 5 of 14
65. (unstack b2 b16)
   deleted: (on b2 b16) (clear b2) (arm-empty)
   added: (holding b2) (clear b16)
   goals met: 5 of 14
66. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 6 of 14
67. (unstack b5 b11)
   deleted: (on b5 b11) (clear b5) (arm-empty)
   added: (holding b5) (clear b11)
   goals met: 6 of 14
68. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 6 of 14
69. (unstack b7 b100)
   deleted: (on b7 b100) (clear b7) (arm-empty)
   added: (holding b7) (clear b100)
   goals met: 6 of 14
70. (stack b7 b2)
   deleted: (clear b2) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b2)
   goals met: 7 of 14
71. (unstack b11 b324)
   deleted: (on b11 b324) (clear b11) (arm-empty)
   added: (holding b11) (clear b324)
   goals met: 7 of 14
72. (stack b11 b7)
   deleted: (clear b7) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b7)
   goals met: 8 of 14
73. (pickup b8)
   deleted: (clear b8) (on-table b8) (arm-empty)
   added: (holding b8)
   goals met: 8 of 14
74. (stack b8 b4)
   deleted: (clear b4) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b4)
   goals met: 9 of 14
75. (unstack b3 b180)
   deleted: (on b3 b180) (clear b3) (arm-empty)
   added: (holding b3) (clear b180)
   goals met: 9 of 14
76. (stack b3 b8)
   deleted: (clear b8) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b8)
   goals met: 10 of 14
77. (unstack b9 b91)
   deleted: (on b9 b91) (clear b9) (arm-empty)
   added: (holding b9) (clear b91)
   goals met: 10 of 14
78. (stack b9 b3)
   deleted: (clear b3) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b3)
   goals met: 11 of 14
79. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 11 of 14
80. (stack b5 b9)
   deleted: (clear b9) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b9)
   goals met: 12 of 14
81. (pickup b10)
   deleted: (clear b10) (on-table b10) (arm-empty)
   added: (holding b10)
   goals met: 11 of 14
82. (stack b10 b5)
   deleted: (clear b5) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b5)
   goals met: 13 of 14
83. (unstack b6 b206)
   deleted: (on b6 b206) (clear b6) (arm-empty)
   added: (holding b6) (clear b206)
   goals met: 12 of 14
84. (stack b6 b11)
   deleted: (clear b11) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b11)
   goals met: 14 of 14
